In [8]:
import pandas as pd
import numpy as np

dic={'red':[1,2,3],'blue':[4,5,6],'black':[7,8,9]}
df=pd.DataFrame(dic)
df.index=['one','two','three']

df

       red  blue  black
one      1     4      7
two      2     5      8
three    3     6      9

In [11]:
nestdict = { 'red': { 2012: 22, 2013: 33 },#dictionary안에 dictionary의 키값이 index가 된다
 'white': { 2011: 13, 2012: 22, 2013: 16},
 'blue': {2011: 17, 2012: 27, 2013: 18}}

df=pd.DataFrame(nestdict)
print(df)
print(df.T)

       red  white  blue
2012  22.0     22    27
2013  33.0     16    18
2011   NaN     13    17
       2012  2013  2011
red    22.0  33.0   NaN
white  22.0  16.0  13.0
blue   27.0  18.0  17.0

In [13]:
ser = pd.Series([5,0,3,8,4], index=['red','blue','yellow','white','green'])
print(ser)
ser.index

red       5
blue      0
yellow    3
white     8
green     4
dtype: int64

Index(['red', 'blue', 'yellow', 'white', 'green'], dtype='object')

In [17]:
ser.idxmin(), ser.idxmax()

('blue', 'white')

In [19]:
serd = pd.Series(range(6), index=['white','white','blue','green', 
'green','yellow'])
serd

white     0
white     1
blue      2
green     3
green     4
yellow    5
dtype: int64

In [21]:
serd['white']

white    0
white    1
dtype: int64

In [23]:
 serd.index.is_unique,df.index.is_unique

(False, True)

In [25]:
#다시 인덱스를 설정
ser = pd.Series([2,5,7,4], index=['one','two','three','four'])
ser

one      2
two      5
three    7
four     4
dtype: int64

In [26]:
ser.reindex(['three','four','five','one'])

three    7.0
four     4.0
five     NaN
one      2.0
dtype: float64

In [27]:
ser3 = pd.Series([1,5,6,3],index=[0,3,5,6])
ser3

0    1
3    5
5    6
6    3
dtype: int64

In [28]:
ser3.reindex(range(6),method='ffill')
#인덱스가 재설정됨==>값이 설정되지 않았던 인덱스가 생김
#그래서 메소드 ffill을 넣으면서 값을 넣어줌(앞에 있는 값을 넣어준다)
#인덱스 1의 값은 없으므로 그 앖의 0의 값을 넣어준다
#반대는 dfill

0    1
1    1
2    1
3    5
4    5
5    6
dtype: int64

In [29]:
s1 = pd.Series([3,2,5,1],['white','yellow','green','blue'])
s2 = pd.Series([1,4,7,2,1],['white','yellow','black','blue','brown'])

In [30]:
s1+s2#같은 인덱스 끼리 더해짐(양쪽 동시에 있어야 됨, 한쪽이라도 없으면 NaN)

black     NaN
blue      3.0
brown     NaN
green     NaN
white     4.0
yellow    6.0
dtype: float64

In [31]:
frame1 = pd.DataFrame(np.arange(16).reshape((4,4)),
index=['red','blue','yellow','white'],
columns=['ball','pen','pencil','paper'])
frame2 = pd.DataFrame(np.arange(12).reshape((4,3)),
index=['blue','green','white','yellow'],
columns=['mug','pen','ball'])

In [32]:
frame1+frame2#dataframe도 양쪽에 같은 인덱스가 있는 것만 더해지고 하나라도 없으면 안됨

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [33]:
 f = lambda x: x.max() - x.min()

In [37]:
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
index=['red','blue','yellow','white'],
columns=['ball','pen','pencil','paper'])
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [35]:
np.sqrt(frame)#자료구조의 원소마다 적용됨

            ball       pen    pencil     paper
red     0.000000  1.000000  1.414214  1.732051
blue    2.000000  2.236068  2.449490  2.645751
yellow  2.828427  3.000000  3.162278  3.316625
white   3.464102  3.605551  3.741657  3.872983

In [36]:
frame.apply(f)
#데이터 프레임의 각 열의 최소최대의 차이를 구함
#ball에서의 최대는 12 최소는 0 12-0==12...
#행/열 선택 가능 axis로 0이면 인덱스,1이면 컬럼

ball      12
pen       12
pencil    12
paper     12
dtype: int64

In [38]:
frame.apply(f, axis=1) #가로로

red       3
blue      3
yellow    3
white     3
dtype: int64

In [39]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min','max'])

In [40]:
frame.apply(f)

     ball  pen  pencil  paper
min     0    1       2      3
max    12   13      14     15

In [49]:
def f(x):
    return pd.Series([x.mean(), x.std()], index=['평균','표준편차'])

In [50]:
frame.apply(f,axis=1)

          평균      표준편차
red      1.5  1.290994
blue     5.5  1.290994
yellow   9.5  1.290994
white   13.5  1.290994

In [51]:
#통계함수
frame.sum()#컬럼들의 합계

ball      24
pen       28
pencil    32
paper     36
dtype: int64

In [54]:
frame.sum(axis=1)#

red        6
blue      22
yellow    38
white     54
dtype: int64

In [55]:
frame.mean(axis=1)

red        1.5
blue       5.5
yellow     9.5
white     13.5
dtype: float64

In [57]:
frame.describe(axis=1)

TypeError: describe() got an unexpected keyword argument 'axis'

In [65]:
ser = pd.Series([5,0,3,8,4],
index=['red','blue','yellow','white','green'])
ser

red       5
blue      0
yellow    3
white     8
green     4
dtype: int64

In [66]:
 ser.sort_index(ascending=False)#내림

yellow    3
white     8
red       5
green     4
blue      0
dtype: int64

In [67]:
ser.sort_index()#오름

blue      0
green     4
red       5
white     8
yellow    3
dtype: int64

In [72]:
frame.sort_values(by=['pen','pencil'])

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [74]:
ser.rank()

red       4.0
blue      1.0
yellow    2.0
white     5.0
green     3.0
dtype: float64

In [75]:
import random as ran

In [89]:
import numpy as np
import pandas as pd
df = pd.DataFrame(np.random.randint(0,100,size=(10,1)))
df.rank()

      0
0   5.0
1   2.0
2   4.0
3   8.0
4   3.0
5   9.0
6  10.0
7   1.0
8   6.0
9   7.0

In [90]:
#상관계수,분산값

seq2 = pd.Series([3,4,3,4,5,4,3,2],['2006','2007','2008',
'2009','2010','2011','2012','2013'])
seq = pd.Series([1,2,3,4,4,3,2,1],['2006','2007','2008',
'2009','2010','2011','2012','2013'])
print(seq.corr(seq2))

seq.cov(seq2)

0.7745966692414835

0.8571428571428571

In [91]:
frame2 = pd.DataFrame([[1,4,3,6],[4,5,6,1],[3,3,1,5],[4,1,6,4]],
index=['red','blue','yellow','white'],
columns=['ball','pen','pencil','paper'])

frame2

        ball  pen  pencil  paper
red        1    4       3      6
blue       4    5       6      1
yellow     3    3       1      5
white      4    1       6      4

In [92]:
frame2.corr()#상관계수==>어느 집단간의 상관관계인가? 각각의 모든 집단의 상관관계
#컬럼에 있는 문자들인 인덱스에 고대로 있음
#즉 ball과  ball관계, ball과 pen,pencil,paper각 각의 관계
#다 하나씩 비교 한다

            ball       pen    pencil     paper
ball    1.000000 -0.276026  0.577350 -0.763763
pen    -0.276026  1.000000 -0.079682 -0.361403
pencil  0.577350 -0.079682  1.000000 -0.692935
paper  -0.763763 -0.361403 -0.692935  1.000000

In [93]:
frame2.cov()#공분산
#공분산의 값을 가지고 상관계수의 상관관계를 알수는 없음
#단지 양수,음수만으로 상관이 있는지 없는지는 알 수 있음

            ball       pen    pencil     paper
ball    2.000000 -0.666667  2.000000 -2.333333
pen    -0.666667  2.916667 -0.333333 -1.333333
pencil  2.000000 -0.333333  6.000000 -3.666667
paper  -2.333333 -1.333333 -3.666667  4.666667

In [95]:
ser = pd.Series([0,1,2,3,9],
index=['red','blue','yellow','white','green'])

In [97]:
frame2.corrwith(ser)#비교할 집단을 정해줌

ball      0.730297
pen      -0.831522
pencil    0.210819
paper    -0.119523
dtype: float64

In [98]:
frame2.corrwith(frame)

ball      0.730297
pen      -0.831522
pencil    0.210819
paper    -0.119523
dtype: float64

# null

In [100]:
ser = pd.Series([0,1,2,np.NaN,9],
index=['red','blue','yellow','white','green'])
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

In [104]:
ser['white'] = None
ser

red       0.0
blue      1.0
yellow    2.0
white     NaN
green     9.0
dtype: float64

In [102]:
ser.dropna()#null값을 넣는 방법,null값을 제거

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [109]:
ser[ser.notnull()]#null이 아닌 것만 뽑아 넣음

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [110]:
frame3 = pd.DataFrame([[6,np.nan,6],[np.nan,np.nan,np.nan],[2,np.nan,5]],
index = ['blue','green','red'],
columns = ['ball','mug','pen'])

frame3

       ball  mug  pen
blue    6.0  NaN  6.0
green   NaN  NaN  NaN
red     2.0  NaN  5.0

In [112]:
frame3.dropna()#null이 있는곳을 지워라 했으니 모든 행,열에 null존재하므로 다 지워짐

Empty DataFrame
Columns: [ball, mug, pen]
Index: []

In [113]:
frame3.dropna(how='all') #모든 행이 null인 행만 아웃

      ball  mug  pen
blue   6.0  NaN  6.0
red    2.0  NaN  5.0

In [114]:
frame3.dropna(axis=1, how='all')#모든 열이 null인 열 아웃

       ball  pen
blue    6.0  6.0
green   NaN  NaN
red     2.0  5.0

In [115]:
frame3.fillna(0)# 값이 없는 곳은 0으로 채우라

       ball  mug  pen
blue    6.0  0.0  6.0
green   0.0  0.0  0.0
red     2.0  0.0  5.0

In [116]:
frame3.fillna({'ball':1,'mug':0,'pen':99})#지정도 가능

       ball  mug   pen
blue    6.0  0.0   6.0
green   1.0  0.0  99.0
red     2.0  0.0   5.0

In [137]:
mser = pd.Series(np.random.rand(8),
index=[['white','white','white','blue','blue','red','red',
 'red'],
['up','down','right','up','down','up','down','left']])
    
mser

white  up       0.702188
       down     0.578779
       right    0.729057
blue   up       0.940782
       down     0.175308
red    up       0.753529
       down     0.986928
       left     0.695559
dtype: float64

In [136]:
mser = pd.Series(np.random.rand(8),
index=[['A','A','B','B','B','C','C','C'],
['1','2','3','4','5','6','7','8']])
    
mser

A  1    0.432122
   2    0.846038
B  3    0.776904
   4    0.212009
   5    0.232988
C  6    0.167432
   7    0.231083
   8    0.289165
dtype: float64

In [142]:
mframe = pd.DataFrame(np.random.randn(16).reshape(4,4),
index=[['white','white','red','red'], ['up','down','up','down']],
columns=[['pen','pen','paper','paper'],[1,2,1,2]])

In [143]:
mframe.columns.names = ['objects','id']
mframe.index.names = ['colors','status']
mframe

objects             pen               paper
id                    1         2         1         2
colors status
white  up     -0.887273 -0.955370 -0.377745 -0.033506
       down    0.444205  1.266345  0.258647 -1.334535
red    up     -1.119081  0.051376  1.067750  1.846951
       down   -0.697622  0.765018 -0.219995  1.762620

In [144]:
mframe.swaplevel('colors','status')

objects             pen               paper
id                    1         2         1         2
status colors
up     white  -0.887273 -0.955370 -0.377745 -0.033506
down   white   0.444205  1.266345  0.258647 -1.334535
up     red    -1.119081  0.051376  1.067750  1.846951
down   red    -0.697622  0.765018 -0.219995  1.762620

# csv 파일

In [150]:
csvframe = pd.read_csv('ch05_01.csv')
csvframe

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

In [152]:
pd.read_table('ch05_01.csv',sep=',')

   white  red  blue  green animal
0      1    5     2      3    cat
1      2    7     8      5    dog
2      3    3     6      7  horse
3      2    2     8      3   duck
4      4    4     2      1  mouse

In [156]:
pd.read_csv('test03.csv', index_col=['color','status'])

              item1  item2  item3
color status
black up          3      4      6
      down        2      6      7
white up          5      5      5
      down        3      3      2
      left        1      2      1
red   up          2      2      2
      down        1      1      4

In [162]:
df = pd.DataFrame(np.random.random((8,3)),
            index=[['A','A','B','B','B','C','C','C'],
                  [1,2,3,4,5,6,7,8]],
            columns=['v1','v2','v3'])
df

           v1        v2        v3
A 1  0.962384  0.267705  0.463744
  2  0.881869  0.665700  0.172147
B 3  0.256519  0.721775  0.851949
  4  0.896460  0.223434  0.423822
  5  0.978381  0.493695  0.014978
C 6  0.728351  0.413887  0.953838
  7  0.999920  0.952935  0.741666
  8  0.035718  0.497987  0.273827

In [158]:
df.to_csv('test.csv')

In [160]:
pd.read_csv('test.csv', index_col=[0,1])

           v1        v2        v3
A 1  0.560411  0.786230  0.077012
  2  0.869394  0.407195  0.007773
B 3  0.901721  0.682315  0.112505
  4  0.895157  0.628275  0.835442
  5  0.219872  0.228153  0.470759
C 6  0.116012  0.874172  0.007697
  7  0.897675  0.588539  0.811450
  8  0.991801  0.629369  0.303547

In [166]:
df=pd.DataFrame(np.arange(16).reshape(4,-1))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [167]:
df.to_csv('simple_df.csv')
print('저장 성공')

저장 성공

In [168]:
pd.read_csv('simple_df.csv')#그냥 읽어오면 인덱스를 인식하지 못함

   Unnamed: 0   0   1   2   3
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [169]:
pd.read_csv('simple_df.csv', index_col=[0])#index지정

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [171]:
df.to_csv('no_index.csv',index=False)

In [172]:
pd.read_csv('no_index.csv')

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

# html

In [176]:
frame = pd.DataFrame(np.arange(4).reshape(2,2))
frame

   0  1
0  0  1
1  2  3

In [177]:
print(frame.to_html())

<table border="1" class="dataframe">
  <thead>
    <tr style="text-align: right;">
      <th></th>
      <th>0</th>
      <th>1</th>
    </tr>
  </thead>
  <tbody>
    <tr>
      <th>0</th>
      <td>0</td>
      <td>1</td>
    </tr>
    <tr>
      <th>1</th>
      <td>2</td>
      <td>3</td>
    </tr>
  </tbody>
</table>

In [185]:
frame = pd.DataFrame( np.random.random((4,4)),
index = ['white','black','red','blue'],
columns = ['up','down','right','left'])

frame

             up      down     right      left
white  0.243487  0.703274  0.294011  0.361665
black  0.599343  0.834775  0.016752  0.213334
red    0.260626  0.098421  0.532189  0.088755
blue   0.662197  0.549717  0.147734  0.175339

In [187]:
s = []
s.append('<HTML>')
s.append('<HEAD><TITLE>df to html</TITLE></HEAD>')
s.append('<BODY>')
s.append(frame.to_html())
s.append('</BODY></HTML>')
html=''.join(s)
html

'<HTML><HEAD><TITLE>df to html</TITLE></HEAD><BODY><table border="1" class="dataframe">\n  <thead>\n    <tr style="text-align: right;">\n      <th></th>\n      <th>up</th>\n      <th>down</th>\n      <th>right</th>\n      <th>left</th>\n    </tr>\n  </thead>\n  <tbody>\n    <tr>\n      <th>white</th>\n      <td>0.243487</td>\n      <td>0.703274</td>\n      <td>0.294011</td>\n      <td>0.361665</td>\n    </tr>\n    <tr>\n      <th>black</th>\n      <td>0.599343</td>\n      <td>0.834775</td>\n      <td>0.016752</td>\n      <td>0.213334</td>\n    </tr>\n    <tr>\n      <th>red</th>\n      <td>0.260626</td>\n      <td>0.098421</td>\n      <td>0.532189</td>\n      <td>0.088755</td>\n    </tr>\n    <tr>\n      <th>blue</th>\n      <td>0.662197</td>\n      <td>0.549717</td>\n      <td>0.147734</td>\n      <td>0.175339</td>\n    </tr>\n  </tbody>\n</table></BODY></HTML>'

In [189]:
with open('df_html.html','w', encoding='utf-8') as fout:
    fout.write(html)
    
print('성공')

성공

In [ ]:
r = pd.read_html('df_html.html')